IDENTIFICATION DIVISION.
PROGRAM-ID. TAREA-MTTR.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 MTTR  PIC 9(4)V9(6).
        01 MP    PIC 9(4)V9(6).
        01 MTBMC PIC 9(4)V9(6).
        01 MTBMP PIC 9(4)V9(6).
        01 MTBM  PIC 9(4)V9(6).
        01 M     PIC 9(4)V9(6).
        01 AO    PIC 9(4)V9(6).
        01 TMP01 PIC 9(4)V9(6).
        01 TMP02 PIC 9(4)V9(6).
        01 TMP03 PIC 9(4)V9(6).
PROCEDURE DIVISION.
    ADD 9.5 30.5 20 10 20 TO TMP01.
    ADD 1 1 1 1 1 TO TMP02.
    DIVIDE TMP01 BY TMP02 GIVING MTTR
    DISPLAY "MTTR: "MTTR.
    
    SET TMP01 TMP02 TO ZERO.
    ADD 8 4.2 6.1 4 4 4 TO TMP01.
    ADD 1 1 1 1 1 1 TO TMP02.
    DIVIDE TMP01 BY TMP02 GIVING MP
    DISPLAY "MP: "MP.
    
    SET TMP01 TMP02 TO ZERO.
    ADD 160 70 200 120 120 120 120 120 50 TO TMP01.
    ADD 1 1 1 1 1 TO TMP02.
    DIVIDE TMP01 BY TMP02 GIVING MTBMC.
    DISPLAY "MTBMC: "MTBMC.
    
    SET TMP01 TMP02 TO ZERO.
    ADD 160 70 200 120 120 120 120 120 50 120 90 TO TMP01.
    ADD 1 1 1 1 1 1 1 TO TMP02.
    DIVIDE TMP01 BY TMP02 GIVING MTBMP.
    DISPLAY "MTBMP: "MTBMP.
    
    DIVIDE 1 BY MTBMP GIVING TMP01.
    DIVIDE 1 BY MTBMC GIVING TMP02.
    ADD TMP02 TO TMP01.
    DIVIDE 1 BY TMP01 GIVING MTBM.
    DISPLAY "MTBM: "MTBM.
    
    DIVIDE MTTR BY MTBMC GIVING TMP01.
    DIVIDE MP BY MTBMP GIVING TMP02.
    ADD TMP02 TO TMP01.
    DIVIDE 1 BY MTBMC GIVING TMP02.
    DIVIDE 1 BY MTBMP GIVING TMP03.
    ADD TMP03 TO TMP02.
    DIVIDE TMP01 BY TMP02 GIVING M.
    DISPLAY "M: "M.
    
    ADD MTBM TO M GIVING TMP01.
    DIVIDE MTBM BY TMP01 GIVING AO.
    DISPLAY "AO: "AO.
    MULTIPLY 100 BY AO.
    DISPLAY "AO: "AO"%".
STOP RUN.
